[
  {
    "sectionName": "Introduction",
    "entries": [
      {
        "title": "Objective",
        "description": "Survive as long as possible against endless waves of enemies. Build up your firing squad, hold the line, and see how far you can get before being overwhelmed.",
        "hint": "There is no final level. The challenge is to push your personal best a little further each run."
      },
      {
        "title": "Game Loop",
        "description": "Enemies spawn from the right side of the screen and march toward your squad. You control a squad of soldiers that hold the enemies back.",
        "hint": "Stay calm in the early waves and focus on positioning and gathering more soldiers. Later waves demand higher firepower, so building it up early will benefit you."
      }
    ]
  },
  {
    "sectionName": "Controls",
    "entries": [
      {
        "title": "Movement",
        "description": "Move your mouse to position your firing squad. Each soldier will try to move toward the cursor, stopping when they are close enough. If other soldiers are in the way, they will shuffle around to find a nearby spot.",
        "hint": "You don't need to be perfectly precise. Just move the cursor roughly where you want the squad to gather."
      },
      {
        "title": "Shooting",
        "description": "Use Space or Left Mouse Button to fire. You can hold it down, and your soldiers will fire as soon as they are able to.",
        "hint": "You don’t have to mash any buttons to fire. Focus on positioning so more of your shots actually hit."
      },
      {
        "title": "Menus",
        "description": "Use the mouse to navigate menus."
      }
    ]
  },
  {
    "sectionName": "Enemies",
    "entries": [
      {
        "title": "Standard Enemies",
        "description": "Standard enemies march straight toward your squad at a normal speed with moderate health. They are a formidable enemy, but don't do anything too special.",
        "hint": "This is the first enemy you will encounter every run. Be sure to handle them quickly so you don't get overrun."
      },
      {
        "title": "Fast Enemies",
        "description": "Fast enemies move quickly but have lower health. They are dangerous because they can close the distance before you expect it.",
        "hint": "Keep your squad slightly farther back from the spawn side when you know fast enemies are coming."
      },
      {
        "title": "Tank Enemies",
        "description": "Tank enemies move slowly but have much higher health. They soak up multiple hits before going down.",
        "hint": "Focus fire on tough enemies before they get too close, especially if they are mixed in with faster units."
      },
      {
        "title": "Evasive Enemies",
        "description": "Evasive enemies move at a moderate speed but dodge side to side to avoid your shots. Hitting this enemy type is more difficult than any of the other enemies.",
        "hint": "Make sure to take these enemies out before they get too close. If you wait too long, you might miss when they're close and let one slip by."
      }
    ]
  },
  {
    "sectionName": "Reinforcements",
    "entries": [
      {
        "title": "Reinforcement Pickups",
        "description": "Soldiers periodically run towards you in the top lane. Colliding your squad with them will add an extra soldier to your squad.",
        "hint": "More soldiers mean more bullets. Try to prioritize adding soldiers to your squad if you can do so safely."
      }
    ]
  },
  {
    "sectionName": "Waves & Difficulty",
    "entries": [
      {
        "title": "Wave Progression",
        "description": "The game is organized into waves. Each wave spawns a set of enemies, and once the last enemy has spawned, the next wave begins immediately. There are no breaks in the apocalypse.",
        "hint": "You can see the current wave number on the HUD. Use it as a rough indicator of how intense things will feel."
      },
      {
        "title": "Pacing",
        "description": "Early waves are intentionally gentle to give you time to learn the controls and build your squad. Later waves will spawn more enemies more quickly. Make sure you're prepared.",
        "hint": "The first ten waves will be the same every run. From then on, waves are randomized and spawn delay is increased linearly."
      }
    ]
  },
  {
    "sectionName": "HUD & Information",
    "entries": [
      {
        "title": "Wave Counter",
        "description": "The current wave number is displayed on the HUD. Higher waves mean more enemies and faster spawns.",
        "hint": "Use the wave number to compare different runs and track your personal best."
      }
    ]
  }
]
